package cn.com.mryhl.demo04_anno;
/**
@Xxx 表示注解
介绍：
    1. 注解是jdk5开始有的
    2. 注解可以加在类上，方法上，变量上...
    3. 程序可以根据注解完成一些功能

 注解和注释：
    注释：是给程序员看的，注释不会被编译和执行
    注解：是给程序看的，程序可以根据注解完成一些功能
 常见的注解：
    @Override：该注解用来验证一个方法是否重写父类的方法
    @FunctionalInterface：该注解用来用来验证一个接口是否是函数式接口
    @Deprecated: 过时标签
 */
/**
 *                        _oo0oo_
 *                       o8888888o
 *                       88" . "88
 *                       (| -_- |)
 *                       0\  =  /0
 *                     ___/`---'\___
 *                   .' \\|     |// '.
 *                  / \\|||  :  |||// \
 *                 / _||||| -:- |||||- \
 *                |   | \\\  - /// |   |
 *                | \_|  ''\---/''  |_/ |
 *                \  .-\__  '-'  ___/-. /
 *              ___'. .'  /--.--\  `. .'___
 *           ."" '<  `.___\_<|>_/___.' >' "".
 *          | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *          \  \ `_.   \_ __\ /__ _/   .-` /  /
 *      =====`-.____`.___ \_____/___.-`___.-'=====
 *                        `=---='
 *
 *
 *      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 *            佛祖保佑       永不宕机     永无BUG
 */
public class Demo01Anno {
    public static void main(String[] args) {
        method();
    }
    /**
     * 定义一个非常厉害的方法
     */
    @Deprecated // 过时标签
    public static void method(){
        System.out.println("牛逼");
    }
}
