package com.itheima02;
/*
    练习: 教练安排运动员跑圈,总共跑3次,每次跑3圈

    问题:
        1.外层循环的初始化表达式  int i = 1 ,总共执行几次? 1次
        2.内层循环的初始化表达式  int j = 1 ,总共执行几次? 3次
        3.内层循环的循环体语句 运动员跑圈 总共执行几次?      9次
			外层循环次数*内层循环每遍执行的次数 = 3*3 = 9
    总结: 外层循环执行一次,内层循环要执行完整的一遍(从初始化表达式开始)
 */
public class Demo01ForFor {
    public static void main(String[] args) {
        /*
            外层for循环第一次:
                i: 1 i <= 3 --> 1<=3 --> true 执行循环体(内层循环)
                内层for循环:
                    j: 1,2,3 j<=3 --> true 执行内层循环的循环体 打印运动员跑圈
                    j: 4 j<=3 --> false 结束内层循环,执行外层循环步进表达式i++,i的值变成2

            外层for循环第二次:
                i: 2 i <= 3 --> 2<=3 --> true 执行循环体(内层循环)
                内层for循环:
                    j: 1,2,3 j<=3 --> true 执行内层循环的循环体 打印运动员跑圈
                    j: 4 j<=3 --> false 结束内层循环,执行外层循环步进表达式i++,i的值变成3

            外层for循环第三次:
                i: 3 i <= 3 --> 3<=3 --> true 执行循环体(内层循环)
                内层for循环:
                    j: 1,2,3 j<=3 --> true 执行内层循环的循环体 打印运动员跑圈
                    j: 4 j<=3 --> false 结束内层循环,执行外层循环步进表达式i++,i的值变成4

            外层for循环第四次:
                i: 4 i <= 3 --> 4<=3 --> false 不再执行循环体,结束外层循环
         */
        for (int i = 1; i <= 3; i++) {//外层for循环: 控制运动员跑的次数
            System.out.println("教练说: 你给我跑第"+i+"次,跑3圈");
            for(int j = 1;j<=3;j++){//内层for循环: 控制运动员每次跑的圈数
                System.out.println("       运动员跑第"+i+"次第"+j+"圈");
            }
        }

       /*
        //1.运动员第1次跑3圈
        for(int j = 1;j<=3;j++){
            System.out.println("运动员跑第1次第"+j+"圈");
        }

        //2.运动员第2次跑3圈
        for(int j = 1;j<=3;j++){
            System.out.println("运动员跑第2次第"+j+"圈");
        }

        //3.运动员第3次跑3圈
        for(int j = 1;j<=3;j++){
            System.out.println("运动员跑第3次第"+j+"圈");
        }*/

    }
}
